day-1-cycle-2.org

#+STARTUP: showall

#+TITLE:     Class 1: Introduction
#+AUTHOR:    Evan Misshula
#+EMAIL:     EMisshula@jjay.cuny.edu
#+DATE:      <2016-11-30 Wed>
#+DESCRIPTION: Introduction to Python 
#+KEYWORDS: 
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:nil toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:nil skip:t d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_HOME: http://vislab-ccom.unh.edu/~schwehr/Classes/2011/esci895-researchtools/

* Class info

| Class Number | Columbia University:                     |
|              | Intro to Python for Digital Storytelling |
| Instructor   | Evan Misshula                            |
| Credits      | 0                                        |
| Enrollment   | ??                                       |
| Semester     | Fall 2016                                |
|              |                                          |

* Cycle 2: Day 1

** 1. Introduction

Common ground
 - who we are
 - why we are doing this
 - why this is important
 - next steps
Introduction to the program

** 2. Project Orientation (1hr)

What is the project?
Principles behind the project.
Storytelling with Twitter
Twitter examples
Twitter structure (character limit, RT, favorites, header image, bio, handle, bots, etc.)
What is a story?
Story ideas brain storm (group)
Job talk (how to use RikersBot when applying for jobs, give ownership)
talk about the industry
  - [[http://fortunesociety.org/][Fortune Society]]
  - [[http://www1.cuny.edu/sites/bmi/][CUNY Black Male Initiative]]
  - [[http://www.techtalentpipeline.nyc/ourprograms/][NYC Tech Talent Pipeline]]
** 3. Physical Computing (1hr, no laptops)

Thinking like a programmer exercises.
- Robot Exercise
  - Ask one group member to do a simple task, like pick up a piece of paper and hand it to another group member. 
  - Now, one person (perhaps the CS person) will pretend to be a robot and try to do the same thing. Have the "robot" interpret all instructions in a very strict manner. Say "do not compute" for things like "hand the paper to Dan". Only accept instructions like "move right leg forward one step." React in funny ways to ambiguous commands, like taking a step with the wrong leg, or not stopping doing something until they ask you. 
  - Be silly.
  - Purpose: Show that computers can't handle ambiguity. They'll do what you want them to do but you have to speak their language!
  - Second purpose: gets group comfortable with teacher, etc.
- Paper airplane exercise
  - Have everyone (possibly in small groups) write out instructions on
    how to fold a paper airplane.
  - Give the instructions from each group to another group.
  - Have everyone try to follow the instructions to make a plane.
  - Throw all the planes-- see which one goes farthest!

