day-1-cycle-2.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">Class info</a></li>
<li><a href="#orgheadline5">Cycle 2: Day 1</a>
<ul>
<li><a href="#orgheadline2">1. Introduction</a></li>
<li><a href="#orgheadline3">2. Project Orientation (1hr)</a></li>
<li><a href="#orgheadline4">3. Physical Computing (1hr, no laptops)</a></li>
</ul>
</li>
</ul>
</div>
</div>


# Class info<a id="orgheadline1"></a>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Class Number</td>
<td class="org-left">Columbia University:</td>
</tr>


<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Intro to Python for Digital Storytelling</td>
</tr>


<tr>
<td class="org-left">Instructor</td>
<td class="org-left">Evan Misshula</td>
</tr>


<tr>
<td class="org-left">Credits</td>
<td class="org-left">0</td>
</tr>


<tr>
<td class="org-left">Enrollment</td>
<td class="org-left">??</td>
</tr>


<tr>
<td class="org-left">Semester</td>
<td class="org-left">Fall 2016</td>
</tr>


<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

# Cycle 2: Day 1<a id="orgheadline5"></a>

## 1. Introduction<a id="orgheadline2"></a>

Common ground

-   who we are
-   why we are doing this
-   why this is important
-   next steps

Introduction to the program

## 2. Project Orientation (1hr)<a id="orgheadline3"></a>

What is the project?
Principles behind the project.
Storytelling with Twitter
Twitter examples
Twitter structure (character limit, RT, favorites, header image, bio, handle, bots, etc.)
What is a story?
Story ideas brain storm (group)
Job talk (how to use RikersBot when applying for jobs, give ownership)
talk about the industry

-   [Fortune Society](http://fortunesociety.org/)
-   [CUNY Black Male Initiative](http://www1.cuny.edu/sites/bmi/)
-   [NYC Tech Talent Pipeline](http://www.techtalentpipeline.nyc/ourprograms/)

## 3. Physical Computing (1hr, no laptops)<a id="orgheadline4"></a>

Thinking like a programmer exercises.

-   Robot Exercise
    -   Ask one group member to do a simple task, like pick up a piece of paper and hand it to another group member.
    -   Now, one person (perhaps the CS person) will pretend to be a robot and try to do the same thing. Have the "robot" interpret all instructions in a very strict manner. Say "do not compute" for things like "hand the paper to Dan". Only accept instructions like "move right leg forward one step." React in funny ways to ambiguous commands, like taking a step with the wrong leg, or not stopping doing something until they ask you.
    -   Be silly.
    -   Purpose: Show that computers can't handle ambiguity. They'll do what you want them to do but you have to speak their language!
    -   Second purpose: gets group comfortable with teacher, etc.
-   Paper airplane exercise
    -   Have everyone (possibly in small groups) write out instructions on
        how to fold a paper airplane.
    -   Give the instructions from each group to another group.
    -   Have everyone try to follow the instructions to make a plane.
    -   Throw all the planes&#x2013; see which one goes farthest!
